class Translation(object):

#This will be appeared when anyone use start command

      START = """Hᴇʟʟᴏ 🤳!!

ɪ ᴀᴍ ᴀ Sᴇʟꜰɪᴇ Mᴏᴠɪᴇ Cᴏɴᴠᴇʀᴛ Bᴏᴛ !

ɪ ᴀᴍ ᴀᴠᴀʙʟᴇ ᴛᴏ ᴄᴏɴᴠᴇʀᴛ ᴠɪᴅᴇᴏ ᴛᴏ ꜰɪʟᴇ ᴀɴᴅ ꜰɪʟᴇ ᴛᴏ ᴠɪᴅᴇᴏ ᴡɪᴛʜ ᴛʜᴜᴍʙɴᴀɪʟ ꜱᴜᴘᴘᴏʀᴛ🖼️.

"""

#This will be appeared when anyone use help command

      HELP = """**Hᴇʏ ᴡᴇʟᴄᴏᴍᴇ ʙᴇʟᴏᴡ ʏᴏᴜ ʜᴀᴠᴇ ᴄᴏᴍᴍᴀɴᴅ ᴛᴏ ʜᴇʟᴘ🤔 ?**

1. ꜱᴇɴᴅ ᴍᴇ ᴛʜᴇ ᴛᴇʟᴇɢʀᴀᴍ ꜰɪʟᴇ ᴏʀ ᴠɪᴅᴇᴏ ᴡʜɪᴄʜ ʏᴏᴜ ᴡᴀɴᴛᴇᴅ ᴛᴏ ᴄᴏɴᴠᴇʀᴛ.

2. ꜱᴇɴᴅ ᴍᴇ ᴛʜᴇ ᴛʜᴜᴍʙɴᴀɪʟ(ᴘʜᴏᴛᴏ) ᴏᴘᴛɪᴏɴᴀʟ.

3. ʀᴇᴘʟʏ ᴛᴏ ᴠɪᴅᴇᴏ /ᴄᴏɴᴠᴇʀᴛᴛᴏꜰɪʟᴇ ꜰᴏʀ ᴄᴏɴᴠᴇʀᴛɪɴɢ ɪɴᴛᴏ ꜰɪʟᴇ.

4. ʀᴇᴘʟʏ ᴛᴏ ꜰɪʟᴇ /ᴄᴏɴᴠᴇʀᴛᴛᴏᴠɪᴅᴇᴏ ꜰᴏʀ ᴄᴏɴᴠᴇʀᴛɪɴɢ ɪɴᴛᴏ ᴠɪᴅᴇᴏ.

**SUPPORT CHANNEL:** [Sᴇʟꜰɪᴇ Mᴏᴠɪᴇ Bᴏᴛ](https://t.me/selfiemoviebot)

"""

#Please don't change this about command 🙏

      Aʙᴏᴜᴛ= """

**📝 Lᴀɴɢᴜᴀɢᴇ:** Python 3

**🧰 Fʀᴀᴍᴇʙᴏᴏᴋ:** Pyrogram

**👨‍💻 Dᴇᴠᴇʟᴏᴘᴇʀ:** [Sᴇʟꜰɪᴇ Mᴏᴠɪᴇ](https://t.me/selfiebd)

**📮 Cʜᴀɴɴᴇʟ:** [Sᴇʟꜰɪᴇ Mᴏᴠɪᴇ Bᴏᴛ](https://t.me/selfiemoviebot)

**💻 Sᴏᴜʀᴄᴇ Cᴏᴅᴇ:**[Pʀᴇꜱꜱ Mᴇ](https://github.com/selfiemovie1/selfie-convert)

"""

####################################################################################################################################################

####################################################################################################################################################

#If you set the password for the bot if anyone use the bot without logging in this text will appear

      NOT_LOGGED_TEXT = """ᴛʜɪꜱ ʙᴏᴛ ᴡᴀꜱ ᴀ ᴘʀɪᴠᴀᴛᴇ ʙᴏᴛ ʏᴏᴜ ɴᴇᴇᴅ ᴛᴏ ʟᴏɢɪɴ ᴜꜱɪɴɢ ᴛʜᴇ ᴘᴀꜱꜱᴡᴏʀᴅ.

ꜰᴏʀ ʟᴏɢɢɪɴɢ ɪɴ ᴜꜱᴇ ᴄᴏᴍᴍᴀɴᴅ <ᴄᴏᴅᴇ>/ʟᴏɢɪɴ ʙᴏᴛᴘᴀꜱꜱᴡᴏʀᴅ</ᴄᴏᴅᴇ>. ᴀɴᴅ ᴛʜᴇɴ ᴜꜱᴇ ᴍᴇ 🤳"""

#This will be sent to the user when the user logged successfully

      SUCESS_LOGIN = """ʏᴏᴜ ᴀʀᴇ ꜱᴜᴄᴄᴇꜱꜱꜰᴜʟʟʏ ʟᴏɢɢᴇᴅ ɪɴ. ꜱᴏ ʏᴏᴜ ᴄᴀɴ ᴜꜱᴇ ᴍᴇ ꜰᴏʀ ᴛᴏᴅᴀʏ.

ʏᴏᴜ ᴀᴄᴄᴇꜱꜱ ᴡɪʟʟ ʙᴇ ʀᴇᴠᴏᴋᴇ ʙʏ ᴛᴏᴍᴏʀʀᴏᴡ 🤳"""

# This will be show when an user send wrong password

      WRONG_PWD = """ᴛʜɪꜱ ɪꜱ ᴀ ᴡʀᴏɴɢ ᴘᴀꜱꜱᴡᴏʀᴅ 🔐 ᴘʟᴇᴀꜱᴇ ᴛʀʏ ᴡɪᴛʜ ᴄᴏʀʀᴇᴄᴛ ᴘᴀꜱꜱᴡᴏʀᴅ 🤳"""

# This will appear if the user is already logged

      EXISTING_USER = "ʏᴏᴜ ᴀʀᴇ ᴀʟʀᴇᴀᴅʏ ʟᴏɢɢᴇᴅ ɪɴ ʏᴏᴜ ᴄᴀɴ ᴜꜱᴇ ᴍᴇ 🤳"

####################################################################################################################################################

####################################################################################################################################################

#DON'T CHANGE THE NUMBERS IN THE FLOWER BRACKETS AND THE ORDER OF PERCENTAGE, DONE, TOTAL, SPEED, ETA ONLY CHANGE THE THEME 

     Pʀᴏɢʀᴇꜱꜱ 🤳 = """

Pᴇʀᴄᴇɴᴛᴀɢᴇ : {0}%

Dᴏɴᴇ ✅: {1}

Tᴏᴛᴀʟ 🌀: {2}

Fᴀꜱᴛ🚀: {3}/s

Eᴛᴀ🕰: {4}

"""

       

      DOWNLOAD_PROGRESS = "▪️"

      UPLOAD_PROGRESS = "▫️"

####################################################################################################################################################

####################################################################################################################################################

      DOWNLOAD_START = " 🤳Tʀʏɪɴɢ Tᴏ Dᴏᴡɴʟᴏᴀᴅ 📥"

      DOWNLOAD_COMPLETE = "✅ Mᴇᴅɪᴀ Dᴏᴡɴʟᴏᴀᴅᴇᴅ Sᴜᴄᴄᴇꜱꜱꜰᴜʟʟʏ\ɴᴘʀᴇᴘᴀʀɪɴɢ Fᴏʀ Uᴘʟᴏᴀᴅ 🤳"

      UPLOAD_START = " 🤳 Tʀʏɪɴɢ Tᴏ Uᴘʟᴏᴀᴅ📤"

      UPLOAD_COMPLETE = "🤳ᴛʜᴀɴᴋꜱ ꜰᴏʀ ᴜꜱɪɴɢ ᴍᴇ 🤳"

      SAVED_CUSTOM_THUMB_NAIL = "✅ ꜱᴀᴠᴇᴅ ᴛʜᴜᴍʙɴᴀɪʟ ꜱᴜᴄᴄᴇꜱꜱꜰᴜʟʟʏ. ᴛʜɪꜱ ᴡɪʟʟ ʙᴇ ᴅᴇʟᴇᴛᴇᴅ ɪɴ 24ʜʀs 🤳"

      BANNED_TEXT = "🤳 ʏᴏᴜ ᴀʀᴇ ʙᴀɴɴᴇᴅ. ꜱᴏ ʏᴏᴜʀ ᴀʀᴇ ɴᴏᴛ ᴀʙʟᴇ ᴛᴏ ᴜꜱᴇ ᴍᴇ 🐒"

      REPLY_TEXT = "👩‍✈️ ʀᴇᴘʟʏ ᴛᴏ ᴛʜᴇ ᴍᴇᴅɪᴀ ᴡʜɪᴄʜ ʏᴏᴜ ɴᴇᴇᴅ ᴛᴏ ᴄᴏɴᴠᴇʀᴛ 🤳"

      DEL_ETED_CUSTOM_THUMB_NAIL = "🤳 ᴛʜᴜᴍʙɴᴀɪʟ ᴅᴇʟᴇᴛᴇᴅ ꜱᴜᴄᴄᴇꜱꜱꜰᴜʟʟʏ✅"
